chore: cosmetic readme updates
